InformationRegisters/Б24_К_Логирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Б24_К_Логирование</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Б24_К_ТипыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Б24_К_НастройкиПодключения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСообщения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Б24_К_Логирование/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Логирование

Процедура ЗаданиеПроверитьУдалитьИсториюОбменов() Экспорт
	
	ОбщиеНастройки = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки");
	Если ОбщиеНастройки <> Неопределено И ОбщиеНастройки.РежимОтладки = Истина Тогда
		ДатаВключенияРежимаОтладки = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ДатаВключенияРежимаОтладки");
		ВремяРаботыРежимаОтладки = 60*60*24;
		Если ДатаВключенияРежимаОтладки = Неопределено ИЛИ ДатаВключенияРежимаОтладки < ТекущаяДатаСеанса() - ВремяРаботыРежимаОтладки Тогда
			ОбщиеНастройки.РежимОтладки = Ложь;
			Б24_К_ОбщегоНазначенияВызовСервера.УстановитьЗначениеВХранилищаНастроек("ОбщиеНастройки", ОбщиеНастройки);
		КонецЕсли;
	КонецЕсли;    
	
	ОбрезатьИсториюОбменов = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки", "ОбрезатьИсториюОбменов");
	Если НЕ ОбрезатьИсториюОбменов = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбрезатьИсториюОбменов = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки", "ЧислоДнейХраненияИстории");
	
	ЧислоДнейХраненияИстории = Б24_К_ОбщегоНазначенияВызовСервера.ПолучитьЗначениеХранилищаНастроек("ОбщиеНастройки","ЧислоДнейХраненияИстории");
	Если ЧислоДнейХраненияИстории = Неопределено Тогда
		ЧислоДнейХраненияИстории = Б24_К_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьОбщиеНастройкиПоУмолчанию().ЧислоДнейХраненияИстории;
	КонецЕсли;
	
	ОбрезатьЛог(ЧислоДнейХраненияИстории);
	
КонецПроцедуры

Процедура ОбрезатьЛог(ЧислоДнейХраненияИстории) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Б24_К_Логирование.Период КАК Период
	|ИЗ
	|	РегистрСведений.Б24_К_Логирование КАК Б24_К_Логирование
	|
	|СГРУППИРОВАТЬ ПО
	|	Б24_К_Логирование.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ВыполненныйЗапрос = Запрос.Выполнить();
	Если НЕ ВыполненныйЗапрос.Пустой() Тогда
		
		ДатаКонца = НачалоДня(ТекущаяДатаСеанса())- 60*60*24*ЧислоДнейХраненияИстории;
		
		Выборка = ВыполненныйЗапрос.Выбрать(); 
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.Период <= ДатаКонца Тогда
				
				НаборЗаписей = РегистрыСведений.Б24_К_Логирование.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Период.Установить(Выборка.Период);
				
				НаборЗаписей.Записать();
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОчиститьИзмеренияЛогирования(СтруктураНастроек) Экспорт
	
	СтруктураНастроек.Логирование.Измерение1 = "";
	СтруктураНастроек.Логирование.Измерение2 = "";
	СтруктураНастроек.Логирование.Измерение3 = "";
	СтруктураНастроек.Логирование.Измерение4 = "";
	СтруктураНастроек.Логирование.Измерение5 = "";
	СтруктураНастроек.Логирование.Измерение6 = "";
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
